In [4]:
import pandas as pd
from sklearn.model_selection import train_test_split

# Приклад: Створимо штучний набір даних
data = {
    'age': [25, 30, 45, 50, 23, 40,42],
    'salary': [50000, 54000, 65000, 70000, 48000, 60000,80000],
    'experience_years': [1, 3, 10, 7, 5, 8,8]
}
df = pd.DataFrame(data)

# Поділ на навчальну (80%) та тестову (20%) вибірки
train_set, test_set = train_test_split(df, test_size=0.2, random_state=42)

print("Навчальна вибірка:")
display(train_set)

print("\nТестова вибірка:")
display(test_set)

Навчальна вибірка:

   age  salary  experience_years
5   40   60000                 8
2   45   65000                10
4   23   48000                 5
3   50   70000                 7
6   42   80000                 8

Тестова вибірка:

   age  salary  experience_years
0   25   50000                 1
1   30   54000                 3

In [5]:
# Приклад групування за кількістю років досвіду
grouped_data = df.groupby('experience_years').agg({'salary': ['mean', 'count']})

print("Агрегація даних за кількістю років досвіду:")
display(grouped_data)

Агрегація даних за кількістю років досвіду:

                   salary
                     mean count
experience_years
1                 50000.0     1
3                 54000.0     1
5                 48000.0     1
7                 70000.0     1
8                 70000.0     2
10                65000.0     1